In [12]:
try:
    import pandas as pd
    # Python SQL toolkit and Object Relational Mapper
    import sqlalchemy
    from sqlalchemy.ext.automap import automap_base
    from sqlalchemy.orm import Session
    from sqlalchemy import create_engine, inspect, func
    import os, sys
    import datetime as dt

    # Import DB key
    from config import config 
    key = config.db_key
        
except Exception as e:
    print(f"a module(s) have not been imported {e}" )

In [2]:
engine = create_engine('postgresql://postgres:'+key+'@localhost:5432/Brazilian E-Commerce')
connection = engine.connect()
tables=engine.table_names()
tables

['stg_olist_order_payments_dataset',
 'stg_olist_order_reviews_dataset',
 'stg_olist_orders_dataset',
 'stg_olist_order_items_dataset',
 'stg_olist_customer_dataset',
 'stg_olist_geolocation_dataset',
 'stg_olist_sellers_dataset',
 'date_dim',
 'products',
 'sellers',
 'product_category',
 'mkt_qualified_leads',
 'mkt_closed_deals',
 'order_payments',
 'order_reviews',
 'orders',
 'order_items',
 'geolocation',
 'customer',
 'stg_olist_closed_deals_dataset',
 'stg_olist_marketing_qualified_leads_dataset',
 'stg_olist_products_dataset',
 'stg_product_category_name_translation']

In [3]:
customer_df=pd.read_sql("select * from stg_olist_customer_dataset", connection)
customer_df.head()

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,09790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,01151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,08775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

In [4]:
customer_df.to_sql(name='customer', con=engine, if_exists='append', index=False)

In [6]:
pd.read_sql("select * from customer", connection).head()

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state,create_date,created_by,changed_date,changed_by
0,aaa,bbb,91911,san diego,ca,2021-02-22,postgres,2021-02-22,postgres
1,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP,2021-02-23,postgres,None,None
2,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,09790,sao bernardo do campo,SP,2021-02-23,postgres,None,None
3,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,01151,sao paulo,SP,2021-02-23,postgres,None,None
4,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,08775,mogi das cruzes,SP,2021-02-23,postgres,None,None

In [5]:
geolocation_df=pd.read_sql("select * from stg_olist_geolocation_dataset", connection)
geolocation_df.head()

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,01037,-23.545621,-46.639292,sao paulo,SP
1,01046,-23.546081,-46.644820,sao paulo,SP
2,01046,-23.546129,-46.642951,sao paulo,SP
3,01041,-23.544392,-46.639499,sao paulo,SP
4,01035,-23.541578,-46.641607,sao paulo,SP

In [7]:
geolocation_df.to_sql(name='geolocation', con=engine, if_exists='append', index=False)

In [8]:
pd.read_sql("select * from geolocation", connection).head()

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state,create_date,created_by,changed_date,changed_by
0,01037,-23.545621,-46.639292,sao paulo,SP,None,None,None,None
1,01046,-23.546081,-46.644820,sao paulo,SP,None,None,None,None
2,01046,-23.546129,-46.642951,sao paulo,SP,None,None,None,None
3,01041,-23.544392,-46.639499,sao paulo,SP,None,None,None,None
4,01035,-23.541578,-46.641607,sao paulo,SP,None,None,None,None

In [10]:
stg_order_items_df=pd.read_sql("select * from stg_olist_order_items_dataset", connection)
stg_order_items_df.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [14]:
order_items_df=stg_order_items_df[['order_id', 'order_item_id', 'product_id','seller_id']].copy()
order_items_df['shipping_limit_date']=stg_order_items_df['shipping_limit_date'].apply(lambda x: dt.datetime.strptime(x, '%Y-%m-%d %H:%M:%S'))
order_items_df['sk_shipping_limit_dt']=stg_order_items_df['shipping_limit_date'].apply(lambda x: int(x[:x.find(' ')].replace('-','')))
order_items_df['price']=stg_order_items_df['price']
order_items_df['freight_value']=stg_order_items_df['freight_value']
order_items_df.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,sk_shipping_limit_dt,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,20170919,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,20170503,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,20180118,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,20180815,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,20170213,199.90,18.14

In [15]:
order_items_df.to_sql(name='order_items', con=engine, if_exists='append', index=False)

In [16]:
pd.read_sql("select * from order_items", connection).head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,sk_shipping_limit_dt,price,freight_value,create_date,created_by,changed_date,changed_by
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,20170919,58.90,13.29,None,None,None,None
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,20170503,239.90,19.93,None,None,None,None
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,20180118,199.00,17.87,None,None,None,None
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,20180815,12.99,12.79,None,None,None,None
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,20170213,199.90,18.14,None,None,None,None